//
//  AppConstants.swift
//  JiroCallGenerator
//
//  Created by 勇太_物販 on 2021/08/19.
//

import Foundation

struct AppConstants {
    static let gachaGarlic:[String] = ["", "ニンニクヌキ", "ニンニクスクナメ", "ニンニクマシ", "ニンニクマシマシ"]
    static let gachaVegetable:[String] = ["", "ヤサイスクナメ", "ヤサイマシ", "ヤサイマシマシ"]
    static let gachaPorkBackFat:[String] = ["", "アブラヌキ", "アブラスクナメ", "アブラマシ", "アブラマシマシ"]
    static let gachaSoySouce:[String] = ["", "カラメ"]
    
    static let callList: [[String]] = [
        ["ニンニク抜き", "ニンニク少なめ", "ニンニク普通", "ニンニク多め", "ニンニク超多め"],
        ["ヤサイ少なめ", "ヤサイ普通", "ヤサイ多め", "ヤサイ超多め"],
        ["背脂抜き", "背脂少なめ", "背脂普通", "背脂多め", "背脂超多め"],
        ["味普通", "味濃いめ"]
    ]
    
    static let CallList: [[String: String]] = [
        [
            "ニンニク抜き": "ニンニクヌキ",
            "ニンニク少なめ": "ニンニクスクナメ",
            "ニンニク普通": "",
            "ニンニク多め": "ニンニクマシ",
            "ニンニク超多め": "ニンニクマシマシ",
        ],
        [
            "ヤサイ少なめ": "ヤサイスクナメ",
            "ヤサイ普通": "",
            "ヤサイ多め": "ヤサイマシ",
            "ヤサイ超多め": "ヤサイマシマシ",
        ],
        [
            "背脂抜き": "アブラヌキ",
            "背脂少なめ": "アブラスクナメ",
            "背脂普通": "",
            "背脂多め": "アブラマシ",
            "背脂超多め": "アブラマシマシ",
        ],
        [
            "味普通": "",
            "味濃いめ": "カラメ",
        ],
    ]
      
//    static let garlicList: [String: String] = [
//        "ニンニク抜き": "ニンニクヌキ",
//        "ニンニク少なめ": "ニンニクスクナメ",
//        "ニンニク普通": "",
//        "ニンニク多め": "ニンニクマシ",
//        "ニンニク超多め": "ニンニクマシマシ",
//    ]
//    static let vegetableList: [String: String] = [
//        "ヤサイ少なめ": "ヤサイスクナメ",
//        "ヤサイ普通": "",
//        "ヤサイ多め": "ヤサイマシ",
//        "ヤサイ超多め": "ヤサイマシマシ",
//    ]
//    static let porkBackFatList: [String: String] = [
//        "背脂抜き": "アブラヌキ",
//        "背脂少なめ": "アブラスクナメ",
//        "背脂普通": "",
//        "背脂多め": "アブラマシ",
//        "背脂超多め": "アブラマシマシ",
//    ]
//    static let soySourceList: [String: String] = [
//        "味普通": "",
//        "味濃いめ": "カラメ",
//    ]
}
